---
kind: method
id: M:Autodesk.Revit.DB.ExternalService.IExternalService.GetVendorId
source: html/34dcde1f-75b9-bfd4-e504-59fca440cf63.htm
---
# Autodesk.Revit.DB.ExternalService.IExternalService.GetVendorId Method

Implement this method to return the vendor Id of the service.

## Syntax (C#)
```csharp
string GetVendorId()
```

## Returns
Vendor Id of the service.

## Remarks
The Id is expected to be a string consisting of 4 characters.